import random

name = input('Введите свой реперский ник: ')
print('''
1. Одинокий Гангстер
2. Миллионер из трущоб
3. Любитель игры в Майнкрафт
4. Ценитель К/Ф Зелёный Слоник
''')
background = input('Выберите своё прошлое: ')

if background == '1':
    print('Вы опасный человече и каждому дадите по жопе, если на то заблагорассудится...')
elif background == '2':
    print('Вы богатый человече и каждому славному друже купите холодный чай Nestea и дадите новый ламборгини')
elif background == '3':
    print('\n''Вы фанат одной замечательной игры, где можно строить механизмы, и вообщемто говоря, ксожалению недооцененной игры...')
    print('----------------')
    print('''
    1. Вьетнамская ловушка
    2. Раздатчик с воронкой
    3. Ферма тростника
    4. Ферма эндерменов
    ''')
    background1 = input('Выберите свой любимый механизм: ')
elif background == '4':
    print('Вы фанат одного замечательного фильма, где подробнейшим образом изучается анатомия человека, а так же социологическая обстановка в военной тюрьме')
    print('-----------------')
    print('''
    1. Пахом
    2. Епифанцев
    3. Полковник
    ''')
    background1 = input('Выберите своего любимого перса: ')
--------------------------
yungleo = {
    'id': 50,
    'name': 'Yung Leo',
    'bars': [punchline_2]
}
fiftydraem = {
    'id' = 51,
    'name': 'Fifty Draem'
    'bars': [punchline_1]
}
creeper = {
    'id': 52,
    'name': 'Kriper95',
    'bars': [punchline_3]
}
Lich = {
    'id': 53,
    'name': 'Lichinus',
    'bars': [punchline_4]
}
=========================
while True:
print('''
Выберите вещи для покупки!
1. вещь
2. вещь2
3. вещь3
0. Выход
''')
buy = input('Введите число: ')
if buy == '1':
    if money >= '50':
        urRapper['inv'].append(вещь)
    if money =< '50':
        print('пошёл в жопу') ##вещи пишем в самом начале
if buy == '2': ##urraper условное обозначение потом поменяем
    if money >= '10':
        urRapper['inv'].append(вещь2)
    if money =< '10':
        print('пошёл в жопу')
if buy == '3':
    if money >= '20':
        urRapper['inv'].append(вещь3)
    if money =< '20':
        print('пошёл в жопу')
